readme.org
#+title: Python Blog
#+subtitle: https://github.com/AlbertoV5/python-blog
#+author: Alberto Valdez
#+SETUPFILE: ./config/org-theme-alt.config
#+SETUPFILE: ./config/org-header.config

* Python Blog
:PROPERTIES:
:CUSTOM_ID: python-blog
:END:

[[https://albertov5.github.io/python-blog/][Webpage here.]]

** [[./static/glob-generators.org][Glob Generators]]
:PROPERTIES:
:CUSTOM_ID: static-glob-generators-org-glob-generators
:END:
Exploring glob patterns and generators in order to find images in a directory using pathlib and PIL.

** [[./static/glob-compare.org][Glob v.s. OS Walk]]
:PROPERTIES:
:CUSTOM_ID: static-glob-compare-org-glob-v-s-os-walk
:END:

Follow-up to "Glob generators in Python", comparing the os.walk and Path.glob methods in the context of generators.

** [[./static/sql-converter.org][SQL Converter]]
:PROPERTIES:
:CUSTOM_ID: static-sql-converter-org-sql-converter
:END:

Using Regex and string processing to convert multiple SQL statements to Python classes (SQLAlchemy and Pydantic models) for using with FastAPI.

** [[./static/module-poetry.org][Python Modules with Poetry]]

Going over the steps for setting up a Poetry project for creating a Python module and starting a development cycle.
