docs/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-20 Sun 23:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python Blog</title>
<meta name="author" content="Alberto Valdez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/css/readtheorg.css"/>
<link rel="shortcut icon" href="https://albertovaldez5.gitlab.io/org-template/resources/theme/favicon.ico">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Python Blog
<br />
<span class="subtitle"><a href="https://github.com/AlbertoV5/python-blog">https://github.com/AlbertoV5/python-blog</a></span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#python-blog">1. Python Blog</a>
<ul>
<li><a href="#static-glob-generators-org-glob-generators">1.1. Glob Generators</a></li>
<li><a href="#static-glob-compare-org-glob-v-s-os-walk">1.2. Glob v.s. OS Walk</a></li>
<li><a href="#static-sql-converter-org-sql-converter">1.3. SQL Converter</a></li>
<li><a href="#static-module-poetry-org-python-modules-with-poetry">1.4. Python Modules with Poetry</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-python-blog" class="outline-2">
<h2 id="python-blog"><span class="section-number-2">1.</span> Python Blog</h2>
<div class="outline-text-2" id="text-python-blog">
<p>
<a href="https://albertov5.github.io/python-blog/">Webpage here.</a>
</p>
</div>

<div id="outline-container-static-glob-generators-org-glob-generators" class="outline-3">
<h3 id="static-glob-generators-org-glob-generators"><span class="section-number-3">1.1.</span> <a href="./static/glob-generators.html">Glob Generators</a></h3>
<div class="outline-text-3" id="text-static-glob-generators-org-glob-generators">
<p>
Exploring glob patterns and generators in order to find images in a directory using pathlib and PIL.
</p>
</div>
</div>

<div id="outline-container-static-glob-compare-org-glob-v-s-os-walk" class="outline-3">
<h3 id="static-glob-compare-org-glob-v-s-os-walk"><span class="section-number-3">1.2.</span> <a href="./static/glob-compare.html">Glob v.s. OS Walk</a></h3>
<div class="outline-text-3" id="text-static-glob-compare-org-glob-v-s-os-walk">
<p>
Follow-up to &ldquo;Glob generators in Python&rdquo;, comparing the os.walk and Path.glob methods in the context of generators.
</p>
</div>
</div>

<div id="outline-container-static-sql-converter-org-sql-converter" class="outline-3">
<h3 id="static-sql-converter-org-sql-converter"><span class="section-number-3">1.3.</span> <a href="./static/sql-converter.html">SQL Converter</a></h3>
<div class="outline-text-3" id="text-static-sql-converter-org-sql-converter">
<p>
Using Regex and string processing to convert multiple SQL statements to Python classes (SQLAlchemy and Pydantic models) for using with FastAPI.
</p>
</div>
</div>

<div id="outline-container-static-module-poetry-org-python-modules-with-poetry" class="outline-3">
<h3 id="static-module-poetry-org-python-modules-with-poetry"><span class="section-number-3">1.4.</span> <a href="./static/module-poetry.html">Python Modules with Poetry</a></h3>
<div class="outline-text-3" id="text-static-module-poetry-org-python-modules-with-poetry">
<p>
Going over the steps for setting up a Poetry project for creating a Python module and starting a development cycle.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Valdez</p>
<p class="date">Created: 2022-11-20 Sun 23:14</p>
</div>
</body>
</html>